package Section_001;

public class 소프트웨어_생명주기 {

	
//	소프트 웨어 생명 주기
//	
//	소프트 웨어 생명 주기는 개발 방법론의 바탕이 되는 것.
//	
//	소프트웨어를 개발하기 위해서 정의하고 운용, 유지보스 등의 과정을 각 단계별로 나눈 것.
//	
//	1. 소프트웨어 생명 주기는 소프트 웨어 개발 단계와 각 단계별 주요활도으 그리고 활동의 결과에 대한 산출물로 표현. 소프트웨어 수명주기라고도 함.
//	
//	2. 소프트웨어 생명 주기를 표현하는 형태를 소프트웨어 생명 주기 모형이라고 함.
//	소프트웨어 프로세스 모형 또는 소프트웨어 공학 패러다임이라고도 함.
//	
//	3. 개발자는 문제의 유형이나 개발 방법 등에 따라 특정 모형을 선택하여 사용할 수도 있고, 개별적인 모형을 사용할 수도 있다.
//	
//	4. 일반적으로 사용되는 소프트웨어 생명 주기 모형에는 폭포수 모형, 프로토타입 모형, 나선형 모형, 애자일 모형 등이 있다.
	
	
	
}
