package Subject_01;

public class 품질_요구사항 {

	
//	품질 요구사항
//	
//	1) 국제 제품 품질 표준
//		- ISO/IEC 9126
//		- ISO/IEC 12119
//		- ISO/IEC 14598
//		- ISO/IEC 25000 : SW 품질 평가 통합 모델, SQuaRE로도 불리며 위 3개표준을 통합 품질 관리, 품질모델, 품질측정, 품질요구, 품질평가
//		# 관모측요평
	
	
//	2) ISO/IEC 9126
//		- 기능성 : 요구사항을 정확하게 만족하는 기능을 제공하는가 ?
//				# 적절성, 정확성, 상호 운용성, 보안성, 호환성
//		- 신뢰성 : 요구된 기능을 정확하고 일관되게 오류없이 수행하는가?
//				# 성숙성, 결함 허용성, 회복성
//		- 사용성 : 사용자가 정확하게 이해하고 사용하는가 ?
//				# 이해성, 학습성, 운용성, 친밀성
//		- 효율성 : 할당된 시간 동안 한정된 자원으로 얼마나 빨리 처리하는가 ?
//				# 시간 효율성, 자원 효율성
//		- 유지 보수성 : 환경의 변화에 소프트웨어를 쉡게 개선, 확장, 수정할 수 있는가 ?
//				# 분석성, 변경성, 안정성, 시험성
//		- 이식성 : 소프트웨어를 다른 환경에서도 쉽게 적용할 수 있는가 ?
//				# 적용성, 설치성, 대체성, 공존성
//				
//		# 기신사 효유이

//	3) ISO/IEC 14598
//		- 반복성, 재현성, 공정성, 객관성

//	4) 국제 프로세스 품질 표준
//		- ISO/IEC 9001
//		- ISO/IEC 12207 : 기본 프로세스, 조직 프로세스, 지원 프로세스
//		# 기조지

//		- ISO/IEC 15504 : 불완전 -> 수행 -> 관리 -> 확립 -> 예측 -> 최적화
//		# 불수관 학예최
//		
//		- CMMI : 조직차원의 성숙도를 평가하는 단계별 표현과 프로세스 영역별 능력도를 평가하는 연속적 표현이 있음




}
