package Subject_02;

public class 자료구조 {

	
//	자료구조.
	
//	1) 자료 구조의 분류
//		=> 선형 구조
//			- 배열
//			- 스택
//			- 큐
//			- 데크
//			- 선택 리스트 = 연속리스트, 연결 리스트
			
//		=> 비선형 구조
//			- 트리
//			- 그래프
//			
//	2) 배열 
//		- 정적인 자료 구조로 기억장소의 추가가 어렵고 메모리의 낭비가 발생함
//		- 점자를 이용
//		- 반복적인 데이터 처리 작업에 적합한 구조
//		- 데이터마다 동일한 이름의 변수를 사용
			
//	3) 스택 
//		- 리스트의 한쪽 끝으로만 자료의 삽입, 삭제 작업이 이뤄지는 자료구조
//		- 후입 선출(LIFO) 방식
//		
//	4) 큐 (Queue)
//		- 리스트의 한쪽에서는 삽입 작업, 다른 한쪽에서는 삭제 작업이 이뤄지는 자료 구조
//		- 선입 선출 방식
//		- 시작가 끝을 표시하는 두개의 포인터가 있음
//		- 운영체제의 작업 스케줄링에 사용함
//		
//	5) 데크
//		- 리스트의 양쪽 끝에서 삽입과 삭제 작업을 할 수 있는 자료구조
//	
//	6) 선형 리스트
//		-> 연속 리스트
//		- 배열과 같이 연속되는 기억장소에 저장되는 자료 구조
//		- ㄱ억장소를 연속적으로 배장받아, 기억장소 이용 효율은 밀도가 1로서 가장 좋음
//		- 중간에 데이터를 삽입하기 위해 연속된 빈 공간이 있어야함.
//		- 사입, 삭제 시 자료의 이동이 필요함
//		
		
		
		
			
}