package Study;

public class DB {

	
	
//	데이터 베이스는 여러 사람에 의해 공동으로 사용될 데이터를 중복을 배제하여 통합하고,
//	쉽게 접근하여 처리할 수 있도록 저장장치에 저장하여 항상 사용할 수 있도록 운영하는 운영 데이터이다.
//	
//	- 통합된 데이터 : 자료의 중복을 배제한 데이터의 모임
//	- 저장된 데이터 : 컴퓨터가 접근할 수 있는 저장 매체에 저장된 자료
//	- 운영 데이터 : 조직의 고유한 업무를 수행하는 데 반드시 필요한 자료
//	- 공용 데이터 : 여러 응용 시스템들이 공동으로 소유하고 유지하는 자료
	
//	DBMS는 사용자의 요구에 따라 정보를 생성해주고, 데이터베이스를 관리해주는 소프트웨어이다.
//	
//	DBMS의 필수 기능 3가지
//	- 정의기능 : 데이터의 형과 구조에 대한 정의, 이용 방식, 제약 조건 등을 명시하는 기능
//	- 조작 기능 : 데이터 검색 갱신 삽입 삭제 등을 위해 인터페이스 수단을 제공하는 기능
//	- 제어 기능 : 데이터의 무결성, 보안, 권한검사 병행제어를 제공하는 기능
//	
//	
	
//	데이터의 독립성
//	
//	논리적 독립성
//		- 응용 프로그램과 데이터 베이스를 독립시킴으로써, 데이터의 논리적 구조를 변경시키더라도 응용 프로그램은 영향을 받지 않음
//		
//	물리적 독립성
//		- 응용 프로그램과 보조기억장치 같은 물리적 장치를 독립시킴으로써
//		디스크를 추가/변경하더라도 응용 프로그램은 영향을 받지 않음


//	스키마란 ?
//			스키마는 데이터 베이스의 구조와 제약조건에 관한 전반적인 명세를 기술한 것이다.
//			
//		
//		외부 스키마 
//			>> 사용자나 응용 프로그래머가 각 개인의 입장에서 필요로 하는 데이터베이스의 논리적 구조를 정의한것.
//		
//		개념 스키마
//			>> 데이터베이스의 전체적인 논리적 구조
//			>> 모든 응용 프로그램이나 사용자들이 필요로 하는 데이터를 종합한 조직 전체의 데이터베이스로 하나만 존재함.
//		내부 스키마
//			>> 물리적 저장장치의 입장에서 본 데이터메이스 구조
//			>> 실제로 저장될 레코드의 형싱, 저장 데이터 항목의 표현 방법, 내부 레코드의 물리적 순서를 나타냄.


}
