package Study;

public class 물리데이터베이스 {


//테이블 
//
//1. 테이블 정의
//: 데이터를 저장하는 DB의 가장 기본적인 객체
//
//
//
//
//엔티티
//
//
//로우 
//튜플 인스턴스 어커런스
//
//컬럼 
//테이블 관리 항모ㅗㄱ에 대한 밸류
//
//기본키
//하나의 컬럼 혹은 몇개의 컬럼 조합으로 어떤 경우라도 테이블 내에서만동일한 값을 갖는 튜플
//
//외래키
//외부 데이터 집합과의 관계
//
//
//논리데이터 모델 - 물리 데이터 
//
//개체 - 테이블속성 - 컬럼
//주 식별자 기본키
//보조 대체 식별자 대체키
//관계 외래키
//
//
//
//메타 데이터 시스템 
//시슽메과 같은 사전에 표준하된 용어가 있을 경우 메타에 등록되어 있는 단어를 사용하여 명명한다.
//메타데이터란?
//메타데이터를 수집하거나 편리하게 사용할 수 있도록 제공하는 시스템
//
//
//반정규화의 정의
//논리 모델링에서 수행도니 정규화 작업을 통해 데이터 모델은 데이터의 중복의 최소화와
//데이터의 일관성, 정확성, 안정성 등을 보장하는 데이터 구조를 완성 할 수 있다.
//반정규화는 정규화된 데이터 몯레이 시스템의 성능 향상, 개발 과정의 편의성, 운영의 단순화를 목적으로 수행되는 의도적인
//정규화 원칙 위배 행위를 말함.
//-> 데이터 모델을 중복, 통합, 분리하는 과정
//
//
//
//수직분할
//: 속성을 기준으로 분할
//
//갱신 위주의 속성분할
//
//자주 조화되는 속성 분할
//특정 속성의 크기가 아주 큰 경우 분할
//
//
//
//인덱스 검색을 빠르게 하기위해서 쌍으로 구석된 보조 데이터
//이진검색을 할수있다 정렬이 되어있어서
//
//클러스터드 인댁스
//물리적으로 데이터를 정렬시킨
//
//논 클러스터드 인덱스 키값만 정렬
//인덱스 검색 후 데이터를 찾음
//한 테이블에 여러개 만들 수 있음
//
//인텍스 특징
//물리적 구조와 밀접한 관계
//레코드의 삽입과 삭제가 수시로 일어나는 경우에는 개수를 최초로 설계
//
//
//
//
//뷰 설계 순서
//대상 테이블 선정 -> 대상 컬럼 선정 - > 뷰 정의서 작성
//
//클러스터드 인덱스와는 다른 개념
//
//인덱스를 사용한 처리 부담이 넓은 분포도에 활용
//분포도가 넓은 테이블에유리하다
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//

	
	
}
