package Study;

public class 요구사항 {

	


//
//요구사항 확인해서 UML 객체지향 모델링언어
//
//다이어그램은
//
//구조적 다이어그램
//
//행위 다이어그램이 있다.
//
//
//유스케이스 다이어그램은 
//
//실선은 연관
//화살표는 직접연관 (직접사용한다.) 라는 의미 
//
//회원가입은 주소입력을 한 후에 요구사항 분석을 한다는 의미이다.
//참조관계를 의미한다.
//
//인클루드는 반드시 !
//익스텐드는 반드시가 아니라 사용할 수 있다 ~
//라는 의미이다.
//
//유스케이스, 액터, 관계, 시스템
//으로 구성이되어있다.
//
//유스케이스 안에서 상호작용의 과정을 글로표현한게
//유스케이스 명세서이다.
//
//활동 다이어그램은사용자의 관점에서 기능을 처리 흐름에 따라서 순서대로 표현하는것
//
//흩허지면 포크 합쳐지면 조인
//
//수영장 보면 
//레일이 정해져있는데
//그걸 스웜레인이라고 한다.
//
//유스케이스 다이어그램, 액티비티 다이어그램은 
//기능 모델링이다 ~ 라고 생각하라.
//
//기능을 검증함.
//
//기능모델링은 사용자 관점에서 요구를 그리는것
//
//
//
//----------------------------------
//
//클래스 다이어그램
//
//
//정적 다이어그램이다. 아래는.
//
//클래스는 객체들의 집합으로 각 객체들이 갖는 속성과 오퍼레이션을 표현.
//
//다중성 표기를 기억할것.
//
//
//접근제한자.
//
//클래스를 표현했을떄
//자바코드를 참고해야함.
//
//public + : 모든 접근을 허용
//protected # 자신을 포함하는 클래스에서 상속받은 클래스에서도 참조가능
//private 자신을 포함한 클래스에서만 참조가능외부 클래스는 접근차단.
//
//
//
//
//
//
//기능 모델링
//시스템이 제공할 기능표현
//
//정적 모델링은
//시스템 내부 구성요소표현
//
//동적 모델링
//시스템 내부 구성요소의 상태가 시간의 흐름에 따라 변화하는과정
//
//
//
//시퀀스 다이어그램
//시스템이나 객체들의 메시지를 주고받으며 시간의 흐름에 따라 액터 객체 메시디 등을 표현
//
//상태 다이어그램
//객체들 사이에 발생하는 이벤트에 의한 객체들의 상태 변화 표현
//
//
//분석 모델 검증.
//요구사항 도출 기법을 활용하여 분석 모델에 대해서 확인.
//
//유스케이스 모델검증
//
//액터, 유스케이스, 유스케이스 명세서이다
//
//
//

	
}
