package C_language;

public class Operator_Type {




//7강 관계연산자, 논리연산자, 조건문
//
//	관계 연산자
//	
//	== 같아 ? 같으면 1 아니면 0
//	!= 같지않아 ? 같으면 0 아니면 1
//	> 
//	>=
//	<
//	<=
//	
//	논리 연산자 
//	
//	!
//	&&
//	||
//	
//	
//	조건문
//	
//	단순 if문
//	
//	if (조건){
//	    조건이 만족할때의 처리;
//	}
//	
//	if ~else문
//	
//	if(조건){
//	    조건이 만족할때 처리;
//	}else {
//	    조건이 아닐떄의 처리;
//	}
//	
//	다중 if문
//	
//	if(조건1){
//	    조건1이 만족
//	} else if(조건 2){
//	    조건 2가 만족
//	} else {
//	    모든 조건이 아닐때
//	}
	
	
	
}
