package C_language;

public class Types_of_variables {

	
//	4상 변수의 종류와 유효범위
//
//    변수의 종류란 ?
//        
//        지역변수
//            - 지역 안에서만 쓰는것
//        전역변수
//            - 공동으로 쓰는것
//        정적변수
//            - 공동으로 쓰는것
//        동적변수
//            - 그때그때 만들어서 쓰는 것
//
//
//지역변수
//    - 함수 / 블록 안에서 선언하는 변수
//    - 함수 / 블록의 종료와 함께 메모리상에서 소멸
//    - 초기값이 없으면 쓰레기 값이 들어감
//    - 스택 영역에 저장됨
//
//정적변수
//    - static으로 선언하며 선언된 블록 내에서만 사용가능
//    - 함수가 종료되어도 소멸되지 않고, 값이 그대로 유지됨.
//    - 프로그램이 종료될 때 메모리상에서 소멸
//    - 초기값이 없으면 0이 입력되고, 단 한번만 초기화
//    - 데이터 영역에 저장됨.
//
//동적변수
//    - 메모리 동적할당으로 생성되는 변수
//    - Rund time 시간에 메모리를 할당
//    - 동적 기억장소에 할당하여 메모리 낭비를 피하려는 목적
//    - 무조건 포인터를 사용해야 함
//    - 힙 영역에서 사용
//

	
}
